Cx = int(input("Введіть координату X центра кільца Cx:"))
Cy = int(input("Введіть координату Y центра кільца Cy:"))

# далі конструкція, щоб правильно ввели радіуси кільця

r1 = 2
r2 = 1

while r1 > r2:
    r1 = int(input("Введіть внутрішній радіус кільца r1:"))
    r2 = int(input("Введіть зовнішній радіус кільца r2:"))
    if r1 > r2:
        print(
            f"""
            !!! Ви припустилися помилки, 
            внутрішній радіус кільця {r1} 
            не може бути більше, ніж зовнішній {r2}
            """)

Px = int(input("Введіть координату X точки Px:"))
Py = int(input("Введіть координату X точки Py:"))

L = ((Px-Cx)**2 + (Py-Cy)**2)**.5

if r1 < L < r2:
    L = "належить"  # використовував ту ж змінну L для економії пам'яті)
else: L = "не належить"

print(f"Точка ({Px}, {Py}) {L} кільцю з центром у точці ({Cx}, {Cy}), та r1 = {r1}, r2 = {r2}")