#!/usr/bin/python3

# Assignment 03-01
#
# Задача: знайти та виведіть на екран - чи належіть точка кільцю 
#      (площа між двома колами з однаковим центром та різним радіусом)
#
# Варіанти виводу на екран:
#
#      1. "Точка (Px, Py) належить кільцю за центром у точці (Cx, Cy), та r1 = R1, r2 = R2"
#      2. "Точка (Px, Py) не належить кільцю за центром у точці (Cx, Cy), та r1 = R1, r2 = R2"
#
# Формула відстані від заданої до центру кола: 
#           
#      L = sqrt((Px-Cx)^2 + (Py-Cy)^2), 
#          
#      якщо умова - r1 < L < r2 - виконується - точка належить кільцю, 
#      інакше - ні
#
#      де: 
#          L - відстань між двома точками з коордінатами
#          Px, Py - координата точки
#          Cx, Cy - координата центру кола r1 та r2
#          r1, r2 - радіус внутрішньго/зовнішнього кола 
#
# Приклад приналежності:
#
# Cx = 0, Cy = 0
# r1 = 3
# r2 = 7
# Px = 4, Py = 5
#
# L = sqrt((4-0)^2 + (5-0)^2) == 6.4
# 3 < 6.4 < 7 то ж точка з такою координатою лежить у площі кільця
#

Cx = int(input("Введіть координату X центра кільца Cx:"))
Cy = int(input("Введіть координату Y центра кільца Cy:"))

# далі конструкція, щоб правильно ввели радіуси кільця

r1 = 2
r2 = 1

while r1 > r2:
    r1 = int(input("Введіть внутрішній радіус кільца r1:"))
    r2 = int(input("Введіть зовнішній радіус кільца r2:"))
    if r1 > r2:
        print(
            f"""
            !!! Ви припустилися помилки, 
            внутрішній радіус кільця {r1} 
            не може бути більше, ніж зовнішній {r2}
            """)

Px = int(input("Введіть координату X точки Px:"))
Py = int(input("Введіть координату X точки Py:"))

L = ((Px-Cx)**2 + (Py-Cy)**2)**.5

if r1 < L < r2:
    L = "належить"  # використовував ту ж змінну L для економії пам'яті)
else: L = "не належить"

print(f"Точка ({Px}, {Py}) {L} кільцю з центром у точці ({Cx}, {Cy}), та r1 = {r1}, r2 = {r2}")

