# Згенерувати, за допомогою list comprehension, послідовність
# цілих чисел 0..N де будуть відсутні кожний  K-ий елемент
#
# N, K запитати у користувача
# K повинно бути менша за N (строго), дозволити ввод К більшого
# за N але відмасштабувати його до розмірів менших за N (%)
#

N = int(input("введіть N:"))
K = int(input("введіть K:"))

if K > N:
    K = K%N
print(f"маштабоване K до розмірів менших за N(%) дорівнює {K}")

l = [i for i in range(N) if not i==K]

print(f"послідовність {l}")

