# Завдання:
#    * згенерувати лист з рандомними числами (числа від 50 до 100 кожне,
#      довжину листа запитати у користувача, але не коротший за 10 та не
#      довший за 50 елементів;
#    * порахувати кількість елементів списку які більше обох своїх сусідніх
#      (зліва та справа)
#
# Підказки:
#    * перший та останній елементи не мають достатьно сусідніх, тому повинні бути виключені

import random
loop = 0
while not(loop):

    nmb = int(input("введіть кількисть випадковіх чисел від 10 до 50: "))
    while nmb < 10 or nmb > 50:
        print("!!!введено число менше 10 або більше 50")
        nmb = int(input("введіть кількисть випадковіх чисел від 10 до 50: "))

    rndm = []
    for _ in range(nmb):
        rndm.append(50+(round(random.random()*100)%50))
    print("\nсгенерована випадкова послідовність:")
    print(rndm)
    rndms = rndm

    n = 0
    for i in range(len(rndm)-2):
        if rndm[i] < rndm[i+1] and rndm[i+2] < rndm[i+1]:
            #print(rndm[i], rndm[i+1], rndm[i+2])
            n += 1
            #print(n)
    print(f"\nкількість елементів списку які більше обох своїх сусідніх: {n}")

    loop = input("\nдля повторного вводу даних натиснить ENTER"
                 "\nдля виходу введить будь який символ: ")
    if not(loop):
        continue
    break