# Завдання: порахуйте кількість літер у строкі. Строка та літера 
#           даються на вхід користувачем. В залежності від кількости
#           виведіть на екран поясненя: строка містить літеру "с" до 
#           10 разів, строка містить літеру "с" до 20 разid, строка містить
#           символ "c" більше 20 разів. Проінформуйте користувача якщо
#           введено більше ніж одну літеру або повідомляти якщо такої літери
#           взагалі не знайдено. Програма повинна використовувати
#           інструкцію цикла для ітерації літер строки (не через метод str).
#           Програма повинна дозволяти користувачу вводити данні до 10 разів
#           (як попередня програма але лімітувати кількість можливостей).
#
# Приклад:
#
# Введіть текст: Це якийсь рандомний текст
# Введіть літеру: й
# Строка містить літеру "й" до 10 разів.
#
# Введіть текст: аааааааааааааааааааааааа
# Введіть літеру: а
# Строка містить літеру "а" більше 20 разів.

i = 0
while i < 10:
    txt = str(input("Введіть текст:"))
    lit = str(input("Введіть літеру:"))
    while len(lit) > 1:
        print("!!!введено більше ніж одну літеру")
        lit = input("Введіть літеру:")
    n = 0
    for x in txt:
        if x == lit:
            n += 1
    #print(n)
    if n == 0:
        print(f"строка не містить літеру '{lit}'")
    elif n < 10:
        print(f"строка містить літеру '{lit}' до 10 разів")
    elif n < 20:
        print(f"строка містить літеру '{lit}' до 20 разів")
    elif n == 20:
        print(f"строка містить літеру '{lit}' 20 раз")
    elif n > 20:
        print(f"строка містить літеру '{lit}' більше 20 разів")
    i += 1
