# Завдання: написати програму обчислення факторіалу числа.
#           Программа запитує ввод від користувача у циклі
#           (вихід можливий за допомогою Ctrl-C/D)
# 
# Факторіал числа: n!
# n! = 1 * 2 * 3 * 4 ... n-1 * n
# 0! = 1
#
# Приклад роботи:
#
# Введіть число для обчислення факторіалу: 5
# 5! == 120
# 
# Введіть число для обчислення факторіалу: -5
# Невірний ввод

while True:
    n = int(input("Введіть число для обчислення факторіалу:"))
    np = n
    f = 1
    if np < 0:
        print("Невірний ввод")

    while n > 1:
        f *= n
        n -= 1

    if np >= 0:
        print(f"{np}! == {f}")